In [2]:
import numpy as np
import pandas as pd

path = 'https://github.com/Rogerio-mack/IMT_Ciencia_de_Dados/raw/main/data/'

Q0. rename(),drop(),replace(),concat()
Combine os dados a seguir em novo DataFrame company incorporando as contratações dos meses de FEV e MAR que não constam do DataFrame company_before.

Considere que:

1- A companhia passará a usar um novo id para os empregados e, portanto, esse dado não precisa constar do novo DataFrame company.

2- No mês de março devido a problemas com mudanças na companhia os dados das contratações encontram-se em1-layout diferente (nome e ordem dos atributos) e foram usados alguns valores categóricos diferentes nos atributos.

In [10]:
company_before = pd.read_csv(path + 'company_before.csv')
company_fev = pd.read_csv(path + 'company_fev.csv')
company_mar = pd.read_csv(path + 'company_mar.csv')

display(company_before.head())
display(company_fev.head())
display(company_mar.head())

,id,Setor,Sexo,Grau_Instrucao,Idade,Anos_Experiencia,Estado,Salario
0,1,Operacao,Masculino,Superior Completo,54,12,SP,2708.410161
1,2,RH,Masculino,Doutorado,52,12,SP,8321.204000
2,3,RH,Masculino,Mestrado,54,12,RJ,7588.139000
3,4,Financeiro,Feminino,Mestrado,32,9,BH,6512.599657
4,5,RH,Masculino,Superior Incompleto,34,8,BH,3125.765000

,id,Setor,Sexo,Grau_Instrucao,Idade,Anos_Experiencia,Estado,Salario
0,1390,Administrativo,Feminino,Superior Incompleto,55,11,SP,1999.616745
1,1407,Marketing,Masculino,Superior Completo,40,17,SP,5139.437521
2,1347,Administrativo,Feminino,Mestrado,35,8,SP,6883.379725
3,1123,Operacao,Masculino,Mestrado,45,16,SP,6386.825060
4,1042,Administrativo,Feminino,Superior Incompleto,43,16,BH,1877.931320

,Sex,Grau_Instrucao,Experiencia,Idade,Estado,Salario,Departamento
0,M,Superior Completo,11,56,SP,3722.984809,Operacao
1,F,Superior Completo,9,31,RJ,10290.856780,Administrativo
2,F,Superior Incompleto,12,53,SP,3583.467000,Recursos Humanos
3,M,Doutorado,16,45,BH,10588.027760,Operacao
4,F,Superior Incompleto,15,46,SP,1995.308000,Administrativo

Dica: Veja a seguir instruções úteis neste exercício.

In [4]:
df = pd.DataFrame({ '123': [1,2,3], 'BBB': ['b','b','c'], 'X':['a','b','c'], 'delete':[None, None, None]})
df

   123 BBB  X delete
0    1   b  a   None
1    2   b  b   None
2    3   c  c   None

In [5]:
df = df.drop(columns=['delete'])
# df.drop(columns=['delete'],inplace=True)
df

   123 BBB  X
0    1   b  a
1    2   b  b
2    3   c  c

In [6]:
df = df.rename(columns={'X':'ABC'})
# df.rename(columns={'X':'ABC'},inplace=True)
df

   123 BBB ABC
0    1   b   a
1    2   b   b
2    3   c   c

In [7]:
df.BBB = df.BBB.replace('c','b')
df

   123 BBB ABC
0    1   b   a
1    2   b   b
2    3   b   c

Exclua o id de company_before e company_fev.

In [11]:
company_before,company_fev = company_before.drop(columns=['id']),company_fev.drop(columns=['id'])
display(company_before.head())
display(company_fev.head())

,Setor,Sexo,Grau_Instrucao,Idade,Anos_Experiencia,Estado,Salario
0,Operacao,Masculino,Superior Completo,54,12,SP,2708.410161
1,RH,Masculino,Doutorado,52,12,SP,8321.204000
2,RH,Masculino,Mestrado,54,12,RJ,7588.139000
3,Financeiro,Feminino,Mestrado,32,9,BH,6512.599657
4,RH,Masculino,Superior Incompleto,34,8,BH,3125.765000

,Setor,Sexo,Grau_Instrucao,Idade,Anos_Experiencia,Estado,Salario
0,Administrativo,Feminino,Superior Incompleto,55,11,SP,1999.616745
1,Marketing,Masculino,Superior Completo,40,17,SP,5139.437521
2,Administrativo,Feminino,Mestrado,35,8,SP,6883.379725
3,Operacao,Masculino,Mestrado,45,16,SP,6386.825060
4,Administrativo,Feminino,Superior Incompleto,43,16,BH,1877.931320

Ajuste o nome das colunas no DataFrame company_mar.

In [21]:
company_mar = company_mar.rename(columns={'Sex':'Sexo','Experiencia':'Anos_Experiencia','Departamento':'Setor'})
company_mar.head()

,Sexo,Grau_Instrucao,Anos_Experiencia,Idade,Estado,Salario,Setor
0,M,Superior Completo,11,56,SP,3722.984809,Operacao
1,F,Superior Completo,9,31,RJ,10290.856780,Administrativo
2,F,Superior Incompleto,12,53,SP,3583.467000,Recursos Humanos
3,M,Doutorado,16,45,BH,10588.027760,Operacao
4,F,Superior Incompleto,15,46,SP,1995.308000,Administrativo

Ajuste a ordem das colunas em company_mar.

In [36]:
company_mar = company_mar.reindex(columns=['Setor','Sexo','Grau_Instrucao','Idade','Anos_Experiencia','Estado','Salario'])
company_mar.head()

,Setor,Sexo,Grau_Instrucao,Idade,Anos_Experiencia,Estado,Salario
0,Operacao,M,Superior Completo,56,11,SP,3722.984809
1,Administrativo,F,Superior Completo,31,9,RJ,10290.856780
2,Recursos Humanos,F,Superior Incompleto,53,12,SP,3583.467000
3,Operacao,M,Doutorado,45,16,BH,10588.027760
4,Administrativo,F,Superior Incompleto,46,15,SP,1995.308000

Verifique e ajuste os valores dos rótulos empregados nos campos object (strings) de company_mar

In [37]:
company_mar.Sexo = company_mar.Sexo.replace('M','Masculino')
company_mar.Sexo = company_mar.Sexo.replace('F', 'Feminino')
company_mar.head()

,Setor,Sexo,Grau_Instrucao,Idade,Anos_Experiencia,Estado,Salario
0,Operacao,Masculino,Superior Completo,56,11,SP,3722.984809
1,Administrativo,Feminino,Superior Completo,31,9,RJ,10290.856780
2,Recursos Humanos,Feminino,Superior Incompleto,53,12,SP,3583.467000
3,Operacao,Masculino,Doutorado,45,16,BH,10588.027760
4,Administrativo,Feminino,Superior Incompleto,46,15,SP,1995.308000

Concatene os DataFrames em um único DataFrame company.

In [90]:
company = pd.concat([company_mar,company_before,company_fev],axis=0)
company.head()

,Setor,Sexo,Grau_Instrucao,Idade,Anos_Experiencia,Estado,Salario
0,Operacao,Masculino,Superior Completo,56,11,SP,3722.984809
1,Administrativo,Feminino,Superior Completo,31,9,RJ,10290.856780
2,Recursos Humanos,Feminino,Superior Incompleto,53,12,SP,3583.467000
3,Operacao,Masculino,Doutorado,45,16,BH,10588.027760
4,Administrativo,Feminino,Superior Incompleto,46,15,SP,1995.308000

---------------------------------------------------------------------------------

Q1. groupby(), get_group()
Empregue os comandos groupby() e get_group() para criar um DataFrame para cada Setor, apenas com seus dados próprios. Salve cada DataFrame em um Arquivo no formato .csv e outro no formato .json. Cada DataFrame terá o nome do setor (setor.csv e setor.json) e apenas as colunas:

['Sexo', 'Grau_instrucao', 'Idade', 'Anos_Experiencia', 'Estado', 'Salario']
(sem Setor!). Em seguida, empregue o comando memory_usage() e obtenha a memória usada por cada DataFrame (.csv).

Um exemplo do DataFrame Administrativo a ser criado:

In [42]:
#@markdown

# Atenção esta não é a solução, é apenas para fornecer o aspecto da saída esperada

temp = company[ company.Setor == 'Administrativo' ].head(5).drop(columns='Setor').reset_index(drop=True).head()

print('DataFrame: Admistrativo')
display( temp.head() )
print()
print( f'memory usage: {temp.memory_usage().sum() / 1024:.1f}KB' )

DataFrame: Admistrativo

,Sexo,Grau_Instrucao,Idade,Anos_Experiencia,Estado,Salario
0,Feminino,Superior Completo,31,9,RJ,10290.856780
1,Feminino,Superior Incompleto,46,15,SP,1995.308000
2,Masculino,Superior Completo,63,8,SP,2769.916194
3,Masculino,Superior Completo,61,9,SP,4275.077705
4,Masculino,Mestrado,32,9,SP,6948.868398

memory usage: 0.4KB

Dica: Veja o exemplo a seguir de como empregar o get_group().

In [ ]:
#@markdown
df = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
    ],
    index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),
)

df

In [ ]:
g = df.groupby('class')

In [ ]:
g.groups.keys()

In [ ]:
g.get_group('bird')

In [45]:
Q1 = company.groupby('Setor')
Q1.groups.keys()

dict_keys(['Administrativo', 'Financeiro', 'Marketing', 'Operacao', 'RH', 'Recursos Humanos'])

In [75]:
Administrativo = Q1.get_group('Administrativo')
Administrativo = Administrativo.drop(columns=['Setor'])
Administrativo.to_csv('Administrativo.csv', index=False)
Administrativo.to_json('Administrativo.json', orient='records')

Financeiro = Q1.get_group('Financeiro')
Financeiro = Financeiro.drop(columns=['Setor'])
Financeiro.to_csv('Financeiro.csv', index=False)
Financeiro.to_json('Financeiro.json', orient='records')

(Moodle) Qual a memória ocupada pelos DataFrames Administrativo e Financeiro criados?
['Sexo', 'Grau_instrucao', 'Idade', 'Anos_Experiencia', 'Estado', 'Salario']
(sem Setor!)

In [76]:
temp = pd.read_csv('Administrativo.csv')
print( f'memory usage Administrativo.csv: {temp.memory_usage().sum() / 1024:.1f}KB' )

temp = pd.read_csv('Administrativo.json')
print( f'memory usage Administrativo.json: {temp.memory_usage().sum() / 1024:.1f}KB' )

temp = pd.read_csv('Financeiro.csv')
print( f'memory usage Financeiro.csv: {temp.memory_usage().sum() / 1024:.1f}KB' )

temp = pd.read_csv('Financeiro.json')
print( f'memory usage Financeiro.json: {temp.memory_usage().sum() / 1024:.1f}KB' )

memory usage Administrativo.csv: 19.0KB
memory usage Administrativo.json: 0.0KB
memory usage Financeiro.csv: 8.5KB
memory usage Financeiro.json: 0.0KB

-------------------------------------------------------------------------------

Q2. to_json
(Moodle) Inspecione o DataFrame json criado. É o que você esperava encontrar? O que melhor descreve o formato encontrado? Verifique em https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_json.html. The format of the JSON string.

-------------------------------------------------------------------------------

Q3. agg(), mode()
Veja os exemplos abaixo de como empregar a função agg() e como criar uma função nova para uso dentro do agg().

dict_keys(['Administrativo', 'Financeiro', 'Marketing', 'Operacao', 'RH', 'Recursos Humanos'])dict_keys(['Administrativo', 'Financeiro', 'Marketing', 'Operacao', 'RH', 'Recursos Humanos'])

In [109]:
Q3 = company.groupby('Setor').agg("Salario")
display(pd.DataFrame(Q3.get_group("Administrativo").mode()).nlargest(10,'Salario'))
display(pd.DataFrame(Q3.get_group("Financeiro").mode()).nlargest(10,'Salario'))
display(pd.DataFrame(Q3.get_group("Marketing").mode()).nlargest(10,'Salario'))
display(pd.DataFrame(Q3.get_group("Operacao").mode()).nlargest(10,'Salario'))
display(pd.DataFrame(Q3.get_group("RH").mode()).nlargest(10,'Salario'))
display(pd.DataFrame(Q3.get_group("Recursos Humanos").mode()).nlargest(10,'Salario'))

      Salario
402  19790.41
401  18097.53
400  17945.62
399  17578.02
398  17306.15
397  17148.12
396  16895.05
395  16758.74
394  16106.52
393  16070.24

         Salario
178  11837.96937
177  11825.47915
176  11344.36545
175  11100.82517
174  11095.95904
173  11076.30159
172  10929.57923
171  10894.77924
170  10813.31032
169  10748.47584

         Salario
191  11797.85578
190  11571.47909
189  11409.29811
188  11398.33818
187  11331.07164
186  11317.96485
185  11301.24377
184  11201.66833
183  11189.58498
182  10823.28046

         Salario
556  12406.65206
555  12085.55215
554  12048.29864
553  11910.84982
552  11905.52915
551  11905.46981
550  11887.09626
549  11885.89983
548  11883.43761
547  11716.45362

       Salario
186  10189.237
185   9465.429
184   8991.566
183   8802.473
182   8414.703
181   8382.517
180   8380.938
179   8322.199
178   8321.204
177   8307.735

    Salario
1  6538.568
0  3583.467

In [111]:
Q3.get_group("Administrativo").mean()

5579.490246096774

Empregue os exemplos para fornecer os valores de moda (atributos categóricos) e médios (atributos numéricos) para todos os valores de company por Setor.

(Moodle) Há algum Setor onde os valores de moda diferem dos demais? Se sim, qual a média de Salário desse Setor?

----------------------------------------------------------------------------------------

Q4. map()
Empregue map() para criar um atributo Codigo_instrucao atribuindo valores inteiros  1  a  n  do menor para o maior Grau_Instrucao (ordem alfabética).

In [131]:
edu = company.Grau_Instrucao.unique()
edu = edu.tolist()
edu.sort()
edu

['Doutorado', 'Mestrado', 'Superior Completo', 'Superior Incompleto']

In [134]:
def educacao(i):
    if i == 'Doutorado':
        return 1
    elif i == 'Mestrado':
        return 2
    elif i == 'Superior Completo':
        return 3
    elif i == 'Superior Incompleto':
        return 4

In [140]:
Q4 = company.Grau_Instrucao.map(educacao)
Q4.sum()

4498

(Moodle) Fazendo o valor de soma dos valores do novo atributo Codigo_Instrucao?

---------------------------------------------------------------------------------------------

Q5. Tabela de contingência, pd.crosstab()
Pesquise pd.crosstab() e o que é uma tabela de contigência. Em seguida construa uma tabela de contigência para responder a seguinte pergunta.

(Moodle) Qual Setor possui menos mulheres trabalhando e qual o percentual que essas mulheres representam de toda a companhia?

dict_keys(['Administrativo', 'Financeiro', 'Marketing', 'Operacao', 'RH', 'Recursos Humanos'])

In [146]:
Q4   = company.groupby('Setor')
TOTAL = company.Sexo.count()

In [153]:
temp = Q4.get_group('Administrativo')
setor = temp.Sexo[temp.Sexo == 'Feminino'].count()
print(f'Administrativo {setor}, \t percentual = {(setor/TOTAL)*100}')

temp = Q4.get_group('Financeiro')
setor = temp.Sexo[temp.Sexo == 'Feminino'].count()
print(f'Financeiro {setor}, \t percentual = {(setor/TOTAL)*100}')

temp = Q4.get_group('Marketing')
setor = temp.Sexo[temp.Sexo == 'Feminino'].count()
print(f'Marketing {setor}, \t percentual = {(setor/TOTAL)*100}')

temp = Q4.get_group('Operacao')
setor = temp.Sexo[temp.Sexo == 'Feminino'].count()
print(f'Operacao {setor}, \t percentual = {(setor/TOTAL)*100}')

temp = Q4.get_group('RH')
setor = temp.Sexo[temp.Sexo == 'Feminino'].count()
print(f'RH {setor}, \t percentual = {(setor/TOTAL)*100}')

temp = Q4.get_group('Recursos Humanos')
setor = temp.Sexo[temp.Sexo == 'Feminino'].count()
print(f'Recursos Humanos {setor}, \t percentual = {(setor/TOTAL)*100}')

Administrativo 163, 	 percentual = 10.723684210526315
Financeiro 72, 	 percentual = 4.736842105263158
Marketing 66, 	 percentual = 4.342105263157895
Operacao 221, 	 percentual = 14.539473684210527
RH 71, 	 percentual = 4.671052631578947
Recursos Humanos 1, 	 percentual = 0.06578947368421052

O crosstab, entretando, é limitado a índices simples.Tabelas semelhantes com índices múltiplos podem ser obtidas combinando-se groupby() com .unstack().

In [ ]:
( company.groupby(["Sexo","Setor","Grau_Instrucao"])[["Salario"]].count().unstack() / len(company) ) # .sum().sum()